In [1]:
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OrdinalEncoder
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import SimpleImputer
from sklearn.impute import KNNImputer
from sklearn.impute import IterativeImputer
from sklearn.base import BaseEstimator
from sklearn.base import TransformerMixin
from sklearn.impute import MissingIndicator

In [2]:
import numpy as np
import pandas as pd

In [3]:
train_set = pd.read_csv("Data/train.csv")

In [4]:
train_set.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,22601,city_61,0.913,NaN,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Funded Startup,2,304,0.0
1,32926,city_104,0.924,Female,No relevent experience,Part time course,Graduate,STEM,19,10000+,Pvt Ltd,4,81,0.0
2,11499,city_114,0.926,Male,Has relevent experience,no_enrollment,Graduate,STEM,10,<10,Pvt Ltd,2,76,0.0
3,23859,city_100,0.887,Male,Has relevent experience,Part time course,Graduate,STEM,>20,NaN,Pvt Ltd,2,53,0.0
4,4916,city_128,0.527,Male,No relevent experience,no_enrollment,Graduate,STEM,5,NaN,NaN,1,92,0.0

In [5]:
job_change = train_set.drop("target", axis=1)

In [6]:
job_change.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,22601,city_61,0.913,NaN,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Funded Startup,2,304
1,32926,city_104,0.924,Female,No relevent experience,Part time course,Graduate,STEM,19,10000+,Pvt Ltd,4,81
2,11499,city_114,0.926,Male,Has relevent experience,no_enrollment,Graduate,STEM,10,<10,Pvt Ltd,2,76
3,23859,city_100,0.887,Male,Has relevent experience,Part time course,Graduate,STEM,>20,NaN,Pvt Ltd,2,53
4,4916,city_128,0.527,Male,No relevent experience,no_enrollment,Graduate,STEM,5,NaN,NaN,1,92

# Testing transformers

In [7]:
job_change_temp = job_change.copy()

In [8]:
job_change_temp.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,22601,city_61,0.913,NaN,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Funded Startup,2,304
1,32926,city_104,0.924,Female,No relevent experience,Part time course,Graduate,STEM,19,10000+,Pvt Ltd,4,81
2,11499,city_114,0.926,Male,Has relevent experience,no_enrollment,Graduate,STEM,10,<10,Pvt Ltd,2,76
3,23859,city_100,0.887,Male,Has relevent experience,Part time course,Graduate,STEM,>20,NaN,Pvt Ltd,2,53
4,4916,city_128,0.527,Male,No relevent experience,no_enrollment,Graduate,STEM,5,NaN,NaN,1,92

In [9]:
num_attribs = ['city_development_index', 'training_hours']
ord_cat_attribs = ['relevent_experience', 'enrolled_university', 'education_level', 'experience', 'company_size', 'last_new_job']
nom_cat_attribs = ['gender', 'major_discipline', 'company_type']

In [10]:
from custom_transformer import OrdToNumeric

In [11]:
ord_transformer = OrdToNumeric()

In [12]:
job_change_temp[ord_cat_attribs] = ord_transformer.fit_transform(job_change_temp[ord_cat_attribs])

d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:23: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['relevent_experience'] = X['relevent_experience'].apply(self.relevent_experience_to_numeric)
d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:24: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['enrolled_university'] = X['enrolled_university'].apply(self.enrolled_university_to_numeric)
d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:25: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['education_level'] = X['education_level'].apply(self.education_level_to_numeric)
d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:26: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['experience'] = X['experience'].apply(self.experience_to_numeric)
d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:27: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['company_size'] = X['company_size'].apply(self.company_size_to_numeric)
d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:28: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['last_new_job'] = X['last_new_job'].apply(self.last_new_job_to_numeric)

In [13]:
job_change_temp[ord_cat_attribs]

,relevent_experience,enrolled_university,education_level,experience,company_size,last_new_job
0,1,0.0,3.0,6.0,2.0,2.0
1,0,1.0,3.0,19.0,7.0,4.0
2,1,0.0,3.0,10.0,0.0,2.0
3,1,1.0,3.0,21.0,NaN,2.0
4,0,0.0,3.0,5.0,NaN,1.0
...,...,...,...,...,...,...
11489,1,0.0,4.0,21.0,NaN,5.0
11490,1,0.0,3.0,21.0,2.0,1.0
11491,0,2.0,2.0,4.0,0.0,1.0
11492,1,0.0,NaN,21.0,7.0,5.0
11493,1,0.0,3.0,17.0,2.0,5.0

In [14]:
from custom_transformer import CustomEncoder

In [15]:
nom_transformer = CustomEncoder()

In [16]:
job_change_temp[nom_cat_attribs] = nom_transformer.fit_transform(job_change_temp[nom_cat_attribs])

C:\Users\Admin\AppData\Roaming\Python\Python37\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)
d:\ComputerScience\BachKhoa\MachineLearning\Project\custom_transformer.py:124: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  lambda x: le_dict.get(x, le_dict['_unk'])).values

In [17]:
job_change_temp[nom_cat_attribs]

      gender major_discipline company_type
0        NaN                5            1
1          0                5            5
2          1                5            5
3          1                5            5
4          1                5          NaN
...      ...              ...          ...
11489      1                5          NaN
11490      1                5            1
11491      1              NaN            0
11492      1              NaN            5
11493      1                5            3

[11494 rows x 3 columns]

In [18]:
job_change_temp.drop(["enrollee_id", "city"], axis=1, inplace=True)

In [19]:
job_change_temp

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,0.913,NaN,1,0.0,3.0,5,6.0,2.0,1,2.0,304
1,0.924,0,0,1.0,3.0,5,19.0,7.0,5,4.0,81
2,0.926,1,1,0.0,3.0,5,10.0,0.0,5,2.0,76
3,0.887,1,1,1.0,3.0,5,21.0,NaN,5,2.0,53
4,0.527,1,0,0.0,3.0,5,5.0,NaN,NaN,1.0,92
...,...,...,...,...,...,...,...,...,...,...,...
11489,0.920,1,1,0.0,4.0,5,21.0,NaN,NaN,5.0,70
11490,0.920,1,1,0.0,3.0,5,21.0,2.0,1,1.0,184
11491,0.558,1,0,2.0,2.0,NaN,4.0,0.0,0,1.0,87
11492,0.920,1,1,0.0,NaN,NaN,21.0,7.0,5,5.0,62
11493,0.887,1,1,0.0,3.0,5,17.0,2.0,3,5.0,105

# Make a pipeline

In [20]:
ord_pipeline = Pipeline([
    ('ord_to_numeric', OrdToNumeric()),
])

In [21]:
nom_pipeline = Pipeline([
    ('custom_encoder', CustomEncoder()),
])

In [22]:
full_pipeline = ColumnTransformer([
    ("num", 'passthrough', num_attribs),
    ("ord", ord_pipeline, ord_cat_attribs),
    ("nom", nom_pipeline, nom_cat_attribs)
])

In [30]:
job_change_prepared = full_pipeline.fit_transform(job_change)

In [24]:
job_change_prepared.shape

(11494, 11)

In [31]:
job_change_prepared[0, :]

array([0.9129999999999999, 304.0, 1.0, 0.0, 3.0, 6.0, 2.0, 2.0, nan, 5, 1],
      dtype=object)

In [26]:
np.savetxt("Data/X_train_tree.csv", job_change_prepared, delimiter=',')

# Test set

In [27]:
test_set = pd.read_csv("Data/test.csv")

In [28]:
test_set.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,6992,city_16,0.910,NaN,Has relevent experience,no_enrollment,Graduate,STEM,6,500-999,Pvt Ltd,1,21,0.0
1,8637,city_103,0.920,Female,Has relevent experience,no_enrollment,Masters,Humanities,>20,100-500,Funded Startup,2,74,0.0
2,24729,city_104,0.924,NaN,Has relevent experience,no_enrollment,Graduate,STEM,9,10/49,Pvt Ltd,1,94,0.0
3,10933,city_21,0.624,Male,Has relevent experience,no_enrollment,Masters,STEM,15,10000+,Pvt Ltd,1,75,0.0
4,28023,city_134,0.698,Male,No relevent experience,no_enrollment,Masters,STEM,12,500-999,NGO,1,157,0.0

In [33]:
test_set = test_set.drop("target", axis=1)

In [34]:
X_test_tree = full_pipeline.transform(test_set)

In [43]:
X_test_tree.shape

(3832, 11)

In [35]:
np.savetxt("Data/X_test_tree.csv", X_test_tree, delimiter=',')

# CV

In [36]:
cv_set = pd.read_csv("Data/cv.csv")

In [38]:
cv_set.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,7509,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,36,0.0
1,75,city_105,0.794,Male,No relevent experience,no_enrollment,High School,NaN,3,NaN,Pvt Ltd,never,14,0.0
2,9476,city_114,0.926,Female,No relevent experience,Full time course,Graduate,STEM,2,NaN,NaN,2,125,0.0
3,16480,city_71,0.884,Male,No relevent experience,Full time course,Graduate,STEM,2,NaN,NaN,1,20,0.0
4,15048,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,100-500,Pvt Ltd,1,46,0.0

In [40]:
cv_set = cv_set.drop("target", axis=1)

In [44]:
X_cv_tree = full_pipeline.transform(cv_set)

In [45]:
X_cv_tree.shape

(3832, 11)

In [ ]:
np.savetxt("Data/X_cv_tree.csv", X_cv_tree, delimiter=',')